#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [17]:
import pandas as pd
data = [4,8,15,16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [18]:
list1 = [1,3,5,7,9,2,4,6,8,10]
pd.Series(list1)

0     1
1     3
2     5
3     7
4     9
5     2
6     4
7     6
8     8
9    10
dtype: int64

#Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
data1 = {"Name": ('Alice', 'Bob', 'Claire'),
        "Age": (25, 30, 27),
        "Gender":("Female", "Male", "Female")}
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [20]:
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
pd.Series(data1)

Name        (Alice, Bob, Claire)
Age                 (25, 30, 27)
Gender    (Female, Male, Female)
dtype: object

#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

apply()
applymap()

In [22]:
import numpy as np
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [9]:
import pandas as pd
r = pd.Series([i*3 for i in range(1, 10)], name='First')
s = pd.Series([i*5 for i in range(1, 10)], name='Second')
pd.concat([r, s], axis=1)

   First  Second
0      3       5
1      6      10
2      9      15
3     12      20
4     15      25
5     18      30
6     21      35
7     24      40
8     27      45